AUTO_config_TK_pesok/src/Documents/ПоступлениеБезналичныхДенежныхСредств/ПоступлениеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеБезналичныхДенежныхСредств</name>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателямиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваКомпании</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DefinedType.ТипыСделок</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДДокументаБУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <comment>Статья движения денежных средств</comment>
      <type>
        <types>CatalogRef.СтатьиДДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <comment>Поставщик/комитент от которого мы получили товар</comment>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорВзаиморасчетов</name>
      <comment>Договор по которому ведутся взаиморасчеты с контрагентом</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТорговаяПлощадка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>DefinedType.ТипыСделок</types>
      </type>
    </attributes>
    <attributes>
      <name>АвтоЗакрытиеСделок</name>
      <comment>Если флажок установлен, то при проведении документа сначала будут оплачены все незакрытые сделки</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Enums/ВидыДоговоров/ВидыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоров</name>
  <comment>Виды договоров</comment>
  <enumValues>
    <name>Покупка</name>
    <comment>Договоры с поставщиками</comment>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
    <comment>Договоры с покупателями</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
    <comment>Договор комиссии</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
    <comment>Договор начисления бонусов</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Общий договор</comment>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяКомиссия</name>
    <comment>Упрощенная комиссия</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Бартерный</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Enums/ВидыОперацийВзаиморасчетов/ВидыОперацийВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийВзаиморасчетов</name>
  <comment>Виды операций взаиморасчетов</comment>
  <enumValues>
    <name>НачислениеДебиторскойЗадолженности</name>
    <comment>Начисление дебиторской задолженности</comment>
  </enumValues>
  <enumValues>
    <name>ПогашениеКредиторскойЗадолженности</name>
    <comment>Погашение кредиторской задолженности</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеКредиторскойЗадолженности</name>
    <comment>Начисление кредиторской задолженности</comment>
  </enumValues>
  <enumValues>
    <name>ПогашениеДебиторскойЗадолженности</name>
    <comment>Погашение дебиторской задолженности</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеКурсовойРазницыБазВалюты</name>
  </enumValues>
  <enumValues>
    <name>СписаниеКурсовойРазницыУпрВалюты</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Catalogs/ХозОперации/ХозОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХозОперации</name>
  <comment>Хозяйственные операции. Содержит предопределенный классификатор оперций и видов проводок конфигурации</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Взаиморасчеты</name>
      <description>Взаиморасчеты</description>
    </items>
    <items>
      <name>ДвиженияДенежныхСредств</name>
      <description>Движения денежных средств</description>
    </items>
    <items>
      <name>ЗаказыНаОтгрузку</name>
      <description>Заказы на отгрузку</description>
    </items>
    <items>
      <name>ЗаказыНаПоставку</name>
      <description>Заказы на поставку</description>
    </items>
    <items>
      <name>Зарплата</name>
      <description>Зарплата</description>
    </items>
    <items>
      <name>Казначейство</name>
      <description>Казначейство</description>
    </items>
    <items>
      <name>КорпоративнаяОтчетность</name>
      <description>Корпоративная отчетность</description>
    </items>
    <items>
      <name>Маркетинг</name>
      <description>Маркетинг</description>
    </items>
    <items>
      <name>ОбменДанными</name>
      <description>Обмен данными</description>
    </items>
    <items>
      <name>ОтгрузкаТМЦ</name>
      <description>Отгрузка ТМЦ</description>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Планирование</name>
      <description>Планирование</description>
    </items>
    <items>
      <name>ПоступлениеТМЦ</name>
      <description>Поступление ТМЦ</description>
      </content>
      </content>
    </items>
    <items>
      <name>Производство</name>
      <description>Производство</description>
    </items>
    <items>
      <name>ПрочиеАктивы</name>
      <description>Прочие активы</description>
    </items>
    <items>
      <name>ПрочиеДокументы</name>
      <description>Прочие документы</description>
    </items>
    <items>
      <name>Регламент</name>
      <description>Регламент</description>
    </items>
    <items>
      <name>РегламентированныйУчет</name>
      <description>Регламентированный учет</description>
    </items>
    <items>
      <name>СервисДеск</name>
      <description>Сервис деск</description>
    </items>
    <items>
      <name>СкладскиеАкты</name>
      <description>Складские акты</description>
    </items>
    <items>
      <name>Транзиты</name>
      <description>Транзиты</description>
    </items>
    <items>
      <name>Ценообразование</name>
      <description>Ценообразование</description>
    </items>
  </predefined>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Documents/ПоступлениеБезналичныхДенежныхСредств/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс


// Процедура заполняет массивы реквизитов, зависимых от хозяйственной операции документа.
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Выбранная хозяйственная операция
//	МассивВсехРеквизитов - Массив - Массив всех имен реквизитов, зависимых от хозяйственной операции
//	МассивРеквизитовОперации - Массив - Массив имен реквизитов, используемых в выбранной хозяйственной операции
//
Функция ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(ХозяйственнаяОперация, МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт
	
	МассивВсехРеквизитов = Новый Массив;	
	МассивВсехРеквизитов.Добавить("БанковскийСчетОтправитель");
	МассивВсехРеквизитов.Добавить("КассаОтправитель");
	МассивВсехРеквизитов.Добавить("КассаККМ");
	МассивВсехРеквизитов.Добавить("ПринятоОТ");
	МассивВсехРеквизитов.Добавить("ГруппаКонтрагент");
	МассивВсехРеквизитов.Добавить("Контрагент");
	//МассивВсехРеквизитов.Добавить("БанковскийСчетКонтрагента");
	МассивВсехРеквизитов.Добавить("ДокументОснование");
	МассивВсехРеквизитов.Добавить("АвтоЗакрытиеСделок");
	
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.СтатьяДДС");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Контрагент");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Организация");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.ТорговаяПлощадка");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.ДоговорВзаиморасчетов");	
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Сумма");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Сделка");
		
	МассивРеквизитовОперации = Новый Массив;
	Если ХозяйственнаяОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеОплатыОтКлиента") Тогда 		
		
		МассивРеквизитовОперации.Добавить("ГруппаКонтрагент");
		МассивРеквизитовОперации.Добавить("Контрагент");
		//МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("ДокументОснование");
		МассивРеквизитовОперации.Добавить("АвтоЗакрытиеСделок");

		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Организация");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ТорговаяПлощадка");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДоговорВзаиморасчетов");	
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Сумма");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Сделка");
		
	ИначеЕсли ХозяйственнаяОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеОплатыПоЭквайрингу") Тогда 		
		
		МассивРеквизитовОперации.Добавить("ГруппаКонтрагент");
		МассивРеквизитовОперации.Добавить("Контрагент");		
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Организация");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ТорговаяПлощадка");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДоговорВзаиморасчетов");	
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Сумма");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Сделка");
		
	ИначеЕсли ХозяйственнаяОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВозвратДенежныхСредствОтПоставщика") Тогда 
		
		МассивРеквизитовОперации.Добавить("ГруппаКонтрагент");
		МассивРеквизитовОперации.Добавить("Контрагент");
		//МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("ДокументОснование");
		МассивРеквизитовОперации.Добавить("АвтоЗакрытиеСделок");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Организация");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ТорговаяПлощадка");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДоговорВзаиморасчетов");	
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Сумма");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Сделка");

	КонецЕсли;
	
КонецФункции


#КонецОбласти
	
#Область Проведение


Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка,ДополнительныеСвойства);

	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ХозОперация = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	
	ТекстыЗапроса = Новый СписокЗначений;
	
	ТекстЗапросаТаблицаДенежныеСредстваКомпании(Запрос, ТекстыЗапроса, Регистры);	
	//ТекстЗапросаРасчетыСПокупателями(Запрос, ТекстыЗапроса, Регистры);							
	//ТекстЗапросаРасчетыСПоставщиками(Запрос, ТекстыЗапроса, Регистры);				
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);				
	
	ПартионныйУчет.ПодготовитьТаблицуЗакрытияСделокСПоставщиками(Запрос, ДополнительныеСвойства);				
	ПартионныйУчет.ПодготовитьТаблицуЗакрытияСделокСПокупателями(Запрос, ДополнительныеСвойства);	
	
	ПартионныйУчет.ПодготовитьТаблицуРасчетыСПоставщиками(Запрос, ДополнительныеСвойства);
	ПартионныйУчет.ПодготовитьТаблицуРасчетыСПокупателями(Запрос, ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка,ДополнительныеСвойства)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеБезналичныхДенежныхСредств.Дата КАК Период,
	               |	ПоступлениеБезналичныхДенежныхСредств.Ссылка КАК Ссылка,
	               |	ПоступлениеБезналичныхДенежныхСредств.ХозОперация КАК ХозОперация,
	               |	ПоступлениеБезналичныхДенежныхСредств.Организация КАК Организация,
	               |	ПоступлениеБезналичныхДенежныхСредств.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ПоступлениеБезналичныхДенежныхСредств.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ПоступлениеБезналичныхДенежныхСредств.ВалютаДокумента КАК ВалютаДокумента,
	               |	ПоступлениеБезналичныхДенежныхСредств.МоментВремени КАК МоментВремени,
	               |	ПоступлениеБезналичныхДенежныхСредств.КурсДокумента КАК КурсДокумента,
	               |	ПоступлениеБезналичныхДенежныхСредств.СуммаДокумента КАК СуммаДокумента,
	               |	ПоступлениеБезналичныхДенежныхСредств.ДокументОснование КАК Сделка,
	               |	ПоступлениеБезналичныхДенежныхСредств.БанковскийСчет КАК БанковскийСчет
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредств.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период", 		Реквизиты.Период);
	Запрос.УстановитьПараметр("МоментВремени", 	Реквизиты.МоментВремени);
	Запрос.УстановитьПараметр("Ссылка", 		Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("КурсДокумента", 	Реквизиты.КурсДокумента);
	Запрос.УстановитьПараметр("ВалютаДокумента",Реквизиты.ВалютаДокумента);
	Запрос.УстановитьПараметр("БанковскийСчет", Реквизиты.БанковскийСчет);
	Запрос.УстановитьПараметр("ХозОперация", 	Реквизиты.ХозОперация);
	Запрос.УстановитьПараметр("РегламентированныйУчет", Истина);
	Запрос.УстановитьПараметр("ВидДоговораПокупка", ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Покупка"));
	Запрос.УстановитьПараметр("ВидДоговораПродажа",ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Продажа"));

	
	ДополнительныеСвойства.ДляПроведения.Вставить("ХозОперация", 	Реквизиты.ХозОперация);
	ДополнительныеСвойства.ДляПроведения.Вставить("МоментВремени", 	Реквизиты.МоментВремени);	
	ДополнительныеСвойства.ДляПроведения.Вставить("СуммаДокумента", Реквизиты.СуммаДокумента);
	ДополнительныеСвойства.ДляПроведения.Вставить("КурсДокумента", 	Реквизиты.КурсДокумента);	
	ДополнительныеСвойства.ДляПроведения.Вставить("ВалютаДокумента",Реквизиты.ВалютаДокумента);
	ДополнительныеСвойства.ДляПроведения.Вставить("РегламентированныйУчет", Истина);
	ДополнительныеСвойства.ДляПроведения.Вставить("ПодразделениеКомпании", 	Реквизиты.ПодразделениеКомпании);

КонецПроцедуры


Функция ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтТаблицаТовары";
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.СтатьяДДС КАК СтатьяДДС,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Контрагент КАК Контрагент,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Организация КАК Организация,
	               |	ВЫБОР
	               |		КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ТорговаяПлощадка <> ЗНАЧЕНИЕ(справочник.торговыеплощадки.пустаяссылка)
	               |			ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ТорговаяПлощадка
	               |		ИНАЧЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТорговаяПлощадка
	               |	КОНЕЦ КАК ТорговаяПлощадка,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	ВЫБОР
	               |		КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ДоговорВзаиморасчетов.ВидДоговора.ВидДоговора = &ВидДоговораПокупка
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК РасчетСПоставщиком,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма КАК Сумма,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сделка КАК Сделка,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НазначениеПлатежа КАК НазначениеПлатежа,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерДок КАК НомерДок,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.АвтоЗакрытиеСделок КАК АвтоЗакрытиеСделок
	               |ПОМЕСТИТЬ ВтТаблицаТовары
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДенежныеСредстваКомпании(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДенежныеСредстваКомпании";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&ВалютаДокумента КАК Валюта,
	               |	&БанковскийСчет КАК СтруктурнаяЕдиница,
	               |	СУММА(ВтТаблицаТовары.Сумма) КАК Сумма,
	               |	&ХозОперация КАК ХозОперация,
	               |	ВтТаблицаТовары.СтатьяДДС КАК СтатьяДДС
	               |ИЗ
	               |	ВтТаблицаТовары КАК ВтТаблицаТовары
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаТовары.СтатьяДДС"; 
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРасчетыСПоставщиками(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РасчетыСПоставщиками";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса ="ВЫБРАТЬ
	              |	&Период КАК Период,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	              |	ВтТаблицаТовары.Контрагент КАК Контрагент,
	              |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	              |	ИСТИНА КАК РегламентированныйУчет,
	              |	СУММА(ВтТаблицаТовары.Сумма) КАК Сумма,
	              |	СУММА(ВтТаблицаТовары.Сумма * &КурсДокумента) КАК СуммаБаз,
	              |	&ХозОперация КАК ХозОперация,
	              |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности) КАК ВидОперации
	              |ИЗ
	              |	ВтТаблицаТовары КАК ВтТаблицаТовары
	              |ГДЕ
	              |	ВтТаблицаТовары.РасчетСПоставщиком
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ВтТаблицаТовары.Контрагент,
	              |	ВтТаблицаТовары.ДоговорВзаиморасчетов"; 
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРасчетыСПокупателями(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РасчетыСПокупателями";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса ="ВЫБРАТЬ
	              |	&Период КАК Период,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	              |	ВтТаблицаТовары.Контрагент КАК Контрагент,
	              |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	              |	ИСТИНА КАК РегламентированныйУчет,
	              |	ВтТаблицаТовары.Сумма КАК Сумма,
	              |	ВтТаблицаТовары.Сумма * &КурсДокумента КАК СуммаБаз,
	              |	&ХозОперация КАК ХозОперация,
	              |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности) КАК ВидОперации
	              |ИЗ
	              |	ВтТаблицаТовары КАК ВтТаблицаТовары
	              |ГДЕ
	              |	НЕ ВтТаблицаТовары.РасчетСПоставщиком"; 
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции


#КонецОбласти
	

#Область Последовательность

Процедура ИнициалзироватьДанныеПоследовательности(Ссылка,ДополнительныеСвойства) Экспорт
	
	ТаблицыДляПоследовательности = Новый Структура("Взаиморасчеты");	
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	&Дата КАК Период,
	                      |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка КАК Регистратор,
	                      |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ДоговорВзаиморасчетов КАК ДоговорКонтрагента
	                      |ИЗ
	                      |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	                      |ГДЕ
	                      |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", ДополнительныеСвойства.ДляПроведения.Дата); 
		
	ТаблицыДляПоследовательности.Взаиморасчеты = Запрос.Выполнить().Выгрузить();
	
	ДополнительныеСвойства.Вставить("ТаблицыДляПоследовательности", ТаблицыДляПоследовательности);
	
КонецПроцедуры

#КонецОбласти	
	
	

#Область ПрограммныйИнтерфейс	

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	КомандаОтчет = ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.МестоРазмещения = "ПодменюОтчеты";
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ПодразделениеКомпании)
	|	И ЗначениеРазрешено(ТорговаяПлощадка)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом



#КонецОбласти	


#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры


#КонецОбласти	
	
	
	
	
	
#КонецЕсли
